html/indexAgdaandHaskell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-28 Tue 08:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="cat" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9203ad5">1. What is Agda?</a></li>
<li><a href="#org5a0376f">2. The Con of Agda.</a></li>
<li><a href="#orgc8cf944">3. The Pro of Agda.</a></li>
<li><a href="#org23148b5">4. Define your own <b>Nature</b> number</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9203ad5" class="outline-2">
<h2 id="org9203ad5"><span class="section-number-2">1</span> What is Agda?</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Agda is dependent type language.</li>
<li>You can use almost any unicode as operator.</li>
<li>Agda is similar to Haskell, but it is fully dependent type.</li>
<li>If you know a bit of Haskell, then it is easy to get start.</li>
</ol>
</div>
</div>

<div id="outline-container-org5a0376f" class="outline-2">
<h2 id="org5a0376f"><span class="section-number-2">2</span> The Con of Agda.</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>It is painful to install.</li>
<li>You need Emacs to input those unicode characters.</li>
<li>You never expect write <b>Agda</b> code on your day job.</li>
<li><b>Agda</b> is painfully slow.</li>
</ol>
</div>
</div>

<div id="outline-container-orgc8cf944" class="outline-2">
<h2 id="orgc8cf944"><span class="section-number-2">3</span> The Pro of Agda.</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>You learn some the most fundamental stuff from Agda, e.g define your own <b>Nature</b> number</li>
<li>You can use lots of <b>unicode</b> characters in your code, make your code looks pretty.</li>
</ol>
</div>
</div>

<div id="outline-container-org23148b5" class="outline-2">
<h2 id="org23148b5"><span class="section-number-2">4</span> Define your own <b>Nature</b> number</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Nature number can be defined as 0, (0 + 1), (0 + 1 + 1), ⋯ etc.
∀ a ∈ ℕ ∣ suc a ∈ ℕ</li>
<li><p>
We can use <b>Peano numbers</b> to represent <b>Nature number</b>. Peano numbers need only a zero and a successor function to represent it.
In Haskell, we can define as following.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #A52A2A; font-weight: bold;">data</span> <span style="color: #2F8B58; font-weight: bold;">Nat</span> <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">Zero</span> <span style="color: #0084C8; font-weight: bold;">|</span> <span style="color: #2F8B58; font-weight: bold;">Suc</span> <span style="color: #2F8B58; font-weight: bold;">Nat</span>
  add <span style="color: #2F8B58; font-weight: bold;">Zero</span> b <span style="color: #0084C8; font-weight: bold;">=</span> b
  add (<span style="color: #2F8B58; font-weight: bold;">Suc</span> a) b <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">Suc</span> (add a b)
</pre>
</div></li>
<li><p>
In Agda
</p>
<div class="org-src-container">
<pre class="src src-agda2">data Nat : Set where
  zero : Nat
  suc : Nat -&gt; Nat

  add Nat -&gt; Nat -&gt; Nat
  add zero b = b
  add (Suc a) b = Suc (add a  b)
</pre>
</div></li>
<li><p>
Define a list in Haskell
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #A52A2A; font-weight: bold;">data</span> <span style="color: #2F8B58; font-weight: bold;">List</span> a <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">Nil</span> <span style="color: #0084C8; font-weight: bold;">|</span> <span style="color: #2F8B58; font-weight: bold;">Cons</span> a (<span style="color: #2F8B58; font-weight: bold;">List</span> a)
</pre>
</div>
<ul class="org-ul">
<li><code>List = []</code> is type constructor with <code>kind * -&gt; kind *</code></li>
<li><code>List a = [a] ~ is type with ~kind *</code></li>
<li><code>Nil = []</code> is value with polymorphic types <code>List a</code> and <code>[a]</code> respectively</li>
<li><code>Cons = :</code> is value constructor with <code>kind * -&gt; kind *</code></li>
</ul></li>
<li><p>
Define a list in Agda
</p>
<div class="org-src-container">
<pre class="src src-agda2">data List (A : Set) : Set where
[] : A
_::_ : A &#8594; List A &#8594; List A
</pre>
</div></li>
<li>What does it mean for above the code?
<ul class="org-ul">
<li><code>Set</code> is type of type in <b>Agda</b></li>
<li><code>A : Set</code>, it means A ∈ Set or A is type of <code>Set</code></li>
<li><code>List (A : Set) : Set</code>, it means type constructor <b>List</b> needs type A is also a Set</li>
<li><code>_::_</code>, it means <b>append</b> a element <code>A</code> to a <code>List A</code> and return a <code>List A</code></li>
</ul></li>
<li><p>
Let see how to define Maybe in Agda, first, we review <b>Haskell</b> Maybe
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #A52A2A; font-weight: bold;">data</span> <span style="color: #2F8B58; font-weight: bold;">Maybe</span> a <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">Nothing</span> <span style="color: #0084C8; font-weight: bold;">|</span> <span style="color: #2F8B58; font-weight: bold;">Just</span> a
</pre>
</div>
<ul class="org-ul">
<li><code>Maybe</code> is just <b>type constructor</b> with ~kind * -&gt; kind * ~</li>
<li><code>Noting</code> is <b>value constructor</b> with type ~kind * ~</li>
<li><code>Just a</code> is <b>value constructor</b> with type ~kind * -&gt; kind * ~</li>
<li><code>Maybe a</code> is type with <code>kind *</code></li>
</ul></li>
<li><p>
Maybe in Agda
</p>
<div class="org-src-container">
<pre class="src src-agda2">data Maybe (A : Set) : Set where
  nothing : Maybe A
  just : A -&gt; Maybe A
</pre>
</div>
<ul class="org-ul">
<li><code>Maybe</code> is just <b>type constructor</b> with <code>Set -&gt; Maybe Set</code></li>
</ul></li>
<li><p>
<b>head</b> function in Haskell
</p>
<div class="org-src-container">
<pre class="src src-haskell">head<span style="color: #0084C8; font-weight: bold;">::</span>[a] <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Maybe</span> a
<span style="color: #00578E; font-size: 110%; font-weight: bold;">head</span> <span style="color: #2F8B58; font-weight: bold;">[]</span> <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">Nothing</span>
<span style="color: #00578E; font-size: 110%; font-weight: bold;">head</span> x<span style="color: #2F8B58; font-weight: bold;">:</span>cs <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">Just</span> x
</pre>
</div></li>
<li><p>
<b>head</b> function in Agda
</p>
<div class="org-src-container">
<pre class="src src-agda2">head : {A : Set} -&gt; List A -&gt; Maybe A
head [] = nothing
head (x :: cs) = just x
</pre>
</div></li>
<li><p>
<b>length</b> function in Agda
</p>
<div class="org-src-container">
<pre class="src src-agda2">length : {A : Set} -&gt; List A -&gt; &#8469;
length [] = zero
length (x :: cs) = suc (length cs)
</pre>
</div></li>
<li><p>
map function in Agda
</p>
<div class="org-src-container">
<pre class="src src-agda2">map {A B : Set} -&gt; (A -&gt; B) -&gt; List A -&gt; List B
map f [] = []
map f (x :: cs) = f x :: map f cs
</pre>
</div></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: cat</p>
<p class="date">Created: 2019-05-28 Tue 08:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
